#include <GL/glut.h>

void display(void)
{
}

int main(int argc, char *argv[])
{
  //GLUT および OpenGL 環境を初期化します. 引数には main の引数をそのまま渡します.
  //X Window で使われるオプション -display などはここで処理されます.
  //この関数によって引数の内容が変更されます. プログラム自身で処理すべき引数があるときは, この後で処理します.
  glutInit(&argc, argv);

  //ウィンドウを開きます. 引数 name はそのウィンドウの名前の文字列で, タイトルバーなどに表示されます.
  //以降の OpenGL による図形の描画等は, 開いたウィンドウに対して行われます. なお, 戻り値は開いたウィンドウの識別子です.
  glutCreateWindow(argv[0]);

  //引数 func は開いたウィンドウ内に描画する関数へのポインタです.
  //ウィンドウが開かれたり, 他のウィンドウによって隠されたウィンドウが再び現れたりして,
  //ウィンドウを再描画する必要があるときに, この関数が実行されます. したがって, この関数内で図形表示を行います.
  glutDisplayFunc(display);

  //これは無限ループです. この関数を呼び出すことで, プログラムはイベントの待ち受け状態になります.
  glutMainLoop();
  return 0;
}
